app/Controllers/Artikel.php

SELECT COUNT(*) AS `numrows`
FROM `artikel`
LEFT JOIN `kategori` ON `kategori`.`id_kategori` = `artikel`.`id_kategori`
WHERE `artikel`.`judul` LIKE '%pemanfaatan%' ESCAPE '!'
AND `artikel`.`id_kategori` = '2'
SELECT `artikel`.*, `kategori`.`nama_kategori`
FROM `artikel`
LEFT JOIN `kategori` ON `kategori`.`id_kategori` = `artikel`.`id_kategori`
WHERE `artikel`.`judul` LIKE '%pemanfaatan%' ESCAPE '!'
AND `artikel`.`id_kategori` = '2'
 LIMIT 5
---
    public function admin_index()
    {
        $q = $this->request->getVar('q') ?? '';
        $kategori_id = $this->request->getVar('kategori_id') ?? '';
        $page = (int) ($this->request->getVar('page') ?? 1);

        $model = new ArtikelModel();

        $builder = $model->select('artikel.*, kategori.nama_kategori')
            ->join('kategori', 'kategori.id_kategori = artikel.id_kategori', 'left');

        if (!empty($q)) {
            $builder->like('artikel.judul', $q);
        }

        if (!empty($kategori_id)) {
            $builder->where('artikel.id_kategori', $kategori_id);
        }

        $artikel = $builder->paginate(5, 'default', $page);

SELECT *
FROM `kategori`
---
        }

        $kategoriModel = new KategoriModel();
        return view('artikel/admin_index', [
            'kategori' => $kategoriModel->findAll(),
        ]);

INSERT INTO `artikel` (`judul`, `isi`, `slug`, `gambar`, `id_kategori`) VALUES ('ini percobaaan artikel 1', 'AI Pengolahan Citra di Industri Manufaktur\r\nPengolahan citra berbasis AI telah merevolusi industri manufaktur dengan meningkatkan efisiensi dan akurasi produksi. Teknologi ini memungkinkan sistem untuk mengenali dan menganalisis gambar secara otomatis, menggantikan inspeksi manual yang memakan waktu.\r\n\r\nSalah satu penerapan utama adalah pemeriksaan kualitas otomatis, di mana AI mendeteksi cacat produk seperti retakan atau kesalahan cetak secara real-time. Selain itu, AI digunakan untuk penyortiran produk, penghitungan otomatis, hingga pengendalian robotik dalam proses perakitan.\r\n\r\nFramework seperti YOLO (You Only Look Once), OpenCV, dan TensorFlow memungkinkan deteksi objek secara cepat dan akurat. AI juga mendukung pemantauan mesin, membantu mendeteksi anomali sebelum terjadi kerusakan besar.', 'ini-percobaaan-artikel-1', 'ai_2.jpg', '2')
---
    public function add()
    {
        $validation = \Config\Services::validation();
        $validation->setRules([
            'judul' => 'required',
            'id_kategori' => 'required|integer'
        ]);

        $isDataValid = $validation->withRequest($this->request)->run();

        if ($isDataValid) {
            $file = $this->request->getFile('gambar');
            $gambar = '';
            if ($file && $file->isValid()) {
                $file->move(ROOTPATH . 'public/gambar');
                $gambar = $file->getName();
            }

            $artikel = new ArtikelModel();
            $artikel->insert([
                'judul' => $this->request->getPost('judul'),
                'isi' => $this->request->getPost('isi'),
                'slug' => url_title($this->request->getPost('judul')),
                'gambar' => $gambar,
                'id_kategori' => $this->request->getPost('id_kategori')
            ]);

SELECT *
FROM `kategori`
---
        }

        $kategoriModel = new KategoriModel();
        $data['kategori'] = $kategoriModel->findAll();

SELECT *
FROM `artikel`
WHERE `artikel`.`id` = '36'
SELECT *
FROM `kategori`
---
    public function edit($id)
    {
        $artikel = new ArtikelModel();
        $validation = \Config\Services::validation();
        $validation->setRules([
            'judul' => 'required',
            'id_kategori' => 'required|integer'
        ]);

        $isDataValid = $validation->withRequest($this->request)->run();

        if ($isDataValid) {
            $artikel->update($id, [
                'judul' => $this->request->getPost('judul'),
                'isi' => $this->request->getPost('isi'),
                'id_kategori' => $this->request->getPost('id_kategori')
            ]);
            return redirect()->to('/admin/artikel');
        }

        $data['artikel'] = $artikel->find($id);
        $kategoriModel = new KategoriModel();
        $data['kategori'] = $kategoriModel->findAll();