app/Controllers/PostApi.php

SELECT *
FROM `artikel`
---
    public function index()
    {
        $model = new ArtikelModel();
        return $this->respond($model->findAll(), 200);

UPDATE `artikel` SET `judul` = 'artikel 6', `isi` = 'rgg'
WHERE `artikel`.`id` IN ('28')
---
    public function update($id = null)
    {
        $model = new ArtikelModel();

        if (!$model->find($id)) {
            return $this->failNotFound("Data dengan ID $id tidak ditemukan");
        }

        // Baca manual data dari PUT form
        parse_str(file_get_contents("php://input"), $data);

        if (empty($data['judul']) || empty($data['isi'])) {
            return $this->failValidationErrors('Judul dan isi harus diisi');
        }

        $model->update($id, $data);

SELECT *
FROM `artikel`
WHERE `artikel`.`id` = '28'
---
    public function delete($id = null)
    {
        $model = new ArtikelModel();

        if (!$model->find($id)) {